.config/doom/config.org
#+title: Gosha's Literate Doom Emacs Config

* TODO refactor doom emacs config
** Identity
- [ ] extract personal identity vars into a separate "private" file or block
** Some sensible defaults
- [ ] move undo settings to a `+core` section or `early-init` if possible
- [ ] decide whether to re-enable `evil-want-fine-undo`
** User Interface
*** Typography
- [ ] document font fallback chain more clearly
- [ ] extract `gt/base-font-size` usage to a macro or theme var
*** Theme
**** Always use midnight mode when opening a PDF file
- [ ] move to file-type specific hook, maybe via `+pdf` module
*** Some small tweaks
**** TODO Remove this once Emacs 30.1 ships
- [ ] verify if the fix is in Emacs 30+ and delete accordingly
**** Frame title
- [ ] simplify or unify title logic across platforms
**** Disable the menu bar
- [ ] check if this is redundant with doom defaults
**** Vim-style tabs: ~tab-bar-mode~
- [ ] audit whether `tab-bar-mode` is actively useful or just bloat
**** Split windows to the right and down by default
- [ ] move to sensible defaults block
**** Projectile tweaks
- [ ] merge with `:tools projectile` config or prune dead options

* Identity
Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates, and snippets.

#+begin_src emacs-lisp :tangle yes
(setq user-full-name "Gosha Tcherednitchenko"
      user-mail-address "mail@gosha.net")
#+end_src

* Some sensible defaults
We want to raise the ~undo-limit~ to 80Mb, use granular undo, and replace ~...~ with a unicode ellipse.
#+begin_src emacs-lisp :tangle yes
(setq undo-limit 80000000
      ;; evil-want-fine-undo t
      truncate-string-ellipsis "…")
#+end_src

* User Interface
** Typography
Let's provide a base font size, from which all others will be calculated.

#+begin_src emacs-lisp :tangle yes
(defvar gt/base-font-size 13
  "The base font size from which all others are calculated")
#+end_src

Setting up the default font faces:

#+begin_src emacs-lisp :tangle yes
(setq doom-font
      (font-spec :family "PragmataPro Mono"
                 :size gt/base-font-size
                 :weight 'normal
                 :spacing 100))
(setq gt/ru-font
      (font-spec :family "Iosevka"
                 :size gt/base-font-size
                 :weight 'normal
                 :spacing 100))
(setq doom-variable-pitch-font
      (font-spec :family "PT Serif" :weight 'regular :height 160 :width 'normal))
#+end_src

If we are on a Mac, use the Apple emoji font; otherwise (on Linux) use the Twitter Color Emoji font.

#+begin_src emacs-lisp :tangle yes
(setq doom-symbol-font
      (if (featurep :system 'macos)
          (font-spec :family "Apple Color Emoji")
        (font-spec :family "Twitter Color Emoji"))
      )
#+end_src

Specify a font for CJK text, for better performance — but only in GUI mode.

#+begin_src emacs-lisp :tangle yes
(if (display-graphic-p)
    (progn
      (when (member "Noto Sans CJK JP" (font-family-list))
        (dolist (charset '(kana han))
          (set-fontset-font t charset (font-spec :family "Noto Sans CJK JP" :size gt/base-font-size) nil 'prepend)))
      (when (member "Noto Sans CJK TC" (font-family-list))
        (dolist (charset '(han cjk-misc bopomofo))
          (set-fontset-font t charset (font-spec :family "Noto Sans CJK TC" :size gt/base-font-size) nil 'append)))))
#+end_src

~TODO:~ Have a different config for Mac and Linux:
- On macOS, use the beautiful system fonts
- On Linux, use Noto Sans CJK

Force using the Russian-specific font (Iosevka) for cyrillic text:

#+begin_src emacs-lisp :tangle yes
(if (display-graphic-p)
    (set-fontset-font
     (frame-parameter nil 'font)
     'cyrillic
     gt/ru-font))
#+end_src

Add a little more line height:

#+begin_src emacs-lisp :tangle yes
(setq-default line-spacing 0.0)
#+end_src

** Theme
We will use the wonderful [[https://protesilaos.com/modus-themes/][Modus Vivendi theme]] by Protesilaos Stavrou, with some slight customisations:

#+begin_src emacs-lisp :tangle yes
;; Add backgrounds to syntax elements and muted color for #_ discard forms
(defun gt/modus-themes-custom-faces ()
  "Add subtle backgrounds to strings, function names, and comments for better
readability."
  (modus-themes-with-colors
    (let ((is-dark (eq (car custom-enabled-themes) 'modus-vivendi)))
      (custom-set-faces
       `(font-lock-string-face ((t (:foreground ,string
                                    :background ,(if is-dark bg-main bg-green-nuanced)))))
       `(font-lock-function-name-face ((t (:foreground ,fnname
                                           :background ,(if is-dark bg-main bg-cyan-nuanced)))))
       `(font-lock-comment-face ((t (:foreground ,comment
                                     :background ,(if is-dark bg-main bg-yellow-nuanced)))))
       `(font-lock-doc-face ((t (:foreground ,docstring
                                 :background ,(if is-dark bg-main bg-green-nuanced)))))
       `(fill-column-indicator ((t (:foreground ,(if is-dark "#333333" "#dddddd")
                                    :background ,bg-main))))
       `(rainbow-delimiters-depth-1-face ((t (:foreground "gray60"))))
       `(rainbow-delimiters-depth-2-face ((t (:foreground "gray60"))))
       `(rainbow-delimiters-depth-3-face ((t (:foreground "gray60"))))
       `(rainbow-delimiters-depth-4-face ((t (:foreground "gray60"))))
       `(rainbow-delimiters-depth-5-face ((t (:foreground "gray60"))))
       `(rainbow-delimiters-depth-6-face ((t (:foreground "gray60"))))
       `(rainbow-delimiters-depth-7-face ((t (:foreground "gray60"))))
       `(rainbow-delimiters-depth-8-face ((t (:foreground "gray60"))))
       `(rainbow-delimiters-depth-9-face ((t (:foreground "gray60"))))
       ;; Muted color for #_ discard forms (removed code)
       `(clojure-character-face ((t (:foreground ,fg-dim))))))))

(add-hook 'modus-themes-after-load-theme-hook #'gt/modus-themes-custom-faces)

;; Custom syntax highlighting palette (inspired by Tonsky's blog)
(defvar gt/modus-syntax-overrides
  '((comment yellow-cooler)
    (docstring green-cooler)
    (string green-cooler)
    (fnname cyan-cooler)
    ;; Make numbers the same color as strings
    (number green-cooler)
    ;; Disable colors for other syntax elements
    (keyword fg-main)
    (builtin fg-main)
    (constant fg-main)
    (type fg-main)
    (variable fg-main)
    (preprocessor fg-main)
    (rx-construct fg-main))
  "Minimal syntax highlighting overrides for all Modus themes.")

(setq modus-themes-bold-constructs t
      modus-themes-common-palette-overrides
      (append '((fringe unspecified)
                (border-mode-line-inactive unspecified)
                (border-mode-line-active unspecified)
                (fg-line-number-inactive "gray50")
                (fg-line-number-active fg-main)
                (bg-line-number-inactive unspecified)
                (bg-line-number-active unspecified)
                (bg-paren-match bg-magenta-intense)
                (underline-paren-match fg-main)
                (fg-region fg-main)
                (bg-mode-line-active bg-cyan-subtle)
                (fg-mode-line-active fg-main))
              gt/modus-syntax-overrides)
      doom-theme 'modus-operandi-tinted)

;; (setq modus-themes-bold-constructs t
;;       modus-themes-common-palette-overrides
;;       '((fringe unspecified)
;;         (comment yellow-cooler)
;;         (border-mode-line-inactive unspecified)
;;         (border-mode-line-active unspecified)
;;         (fg-line-number-inactive "gray50")
;;         (fg-line-number-active fg-main)
;;         (bg-line-number-inactive unspecified)
;;         (bg-line-number-active unspecified)
;;         (bg-paren-match bg-magenta-intense)
;;         (underline-paren-match fg-main)
;;         (fg-region fg-main)
;;         (bg-mode-line-active bg-cyan-subtle)
;;         (fg-mode-line-active fg-main))
;;       doom-theme 'modus-operandi-tinted)

;; Apply customizations after initial theme load
(add-hook 'doom-load-theme-hook #'gt/modus-themes-custom-faces)

;; Highlight numbers with the same color and background as strings
(use-package! highlight-numbers
  :hook (prog-mode . highlight-numbers-mode)
  :config
  (defun gt/set-number-color ()
    "Set numbers to the same color and background as strings."
    (modus-themes-with-colors
      (let ((is-dark (eq (car custom-enabled-themes) 'modus-vivendi)))
        (set-face-attribute 'highlight-numbers-number nil
                            :foreground string
                            :background (if is-dark bg-main bg-green-nuanced)))))

  (add-hook 'modus-themes-after-load-theme-hook #'gt/set-number-color)
  (add-hook 'doom-load-theme-hook #'gt/set-number-color))
#+end_src

*** Automatically toggle themes based on OS dark/light theme

#+begin_src emacs-lisp :tangle yes
(after! doom-ui
  (setq! auto-dark-themes '((modus-vivendi) (modus-operandi-tinted)))
  (auto-dark-mode))
#+end_src

*** Set keyboard shortcut to toggle between light/dark Modus themes.

#+begin_src emacs-lisp :tangle yes
(setq modus-themes-to-toggle '(modus-operandi-tinted modus-vivendi))
(define-key doom-leader-map (kbd "t m")
  'modus-themes-toggle)
#+end_src
*** Always use midnight mode when opening a PDF file

#+begin_src emacs-lisp :tangle yes
;; (add-hook 'pdf-tools-enabled-hook 'pdf-view-midnight-minor-mode)
#+end_src

** Some small tweaks
*** TODO Remove this once Emacs 30.1 ships
This needed to be redefined in order to build the pdf-tools

#+begin_src emacs-lisp :tangle yes
;; (defvar x-gtk-use-system-tooltips use-system-tooltips)
#+end_src

*** Frame title
Set the frame title to include the name of the current ~persp-mode~ workspace:

#+begin_src emacs-lisp :tangle yes
(setq
 frame-title-format
 '("%b — "
   (:eval
    (format "%s"  persp-last-persp-name))
   " — Emacs"
   ))
#+end_src

*** Disable the menu bar
#+begin_src emacs-lisp :tangle yes
(menu-bar-mode -1)
#+end_src

*** Vim-style tabs: ~tab-bar-mode~
I miss the way Vim tabs work, and it seems like ~tab-bar-mode~ is a good solution to implement something like this.

Links: [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Tab-Bars.html][documentation]], [[https://www.rousette.org.uk/archives/using-the-tab-bar-in-emacs/][BSAG blog post]].

Also integrate ~tab-bar-mode~ and ~persp-mode~, as stolen from [[https://github.com/LemonBreezes/.doom.d/blob/master/lisp/persp-mode-tab-bar-integration.el][here]] (originally found [[https://github.com/Bad-ptr/persp-mode.el/issues/122#issuecomment-1224884651][here]]).

#+begin_src emacs-lisp :tangle yes
(use-package! tab-bar
  :after emacs
  :config
  (setq tab-bar-close-button-show   nil
        tab-bar-new-button-show     nil
        tab-bar-auto-width          nil
        tab-bar-back-button         nil
        tab-bar-forward-button      nil
        tab-bar-show                1)
  (define-key evil-normal-state-map (kbd "g t") #'tab-bar-switch-to-next-tab)
  (define-key evil-normal-state-map (kbd "g T") #'tab-bar-switch-to-prev-tab)
  (define-key global-map (kbd "s-t") #'tab-bar-new-tab)

  (add-hook 'persp-before-deactivate-functions
            (defun +workspaces-save-tab-bar-data-h (_)
              "Save the tab-bar-tabs  "
              (when (get-current-persp)
                (set-persp-parameter
                 'tab-bar-tabs (tab-bar-tabs))
                (set-persp-parameter 'tab-bar-closed-tabs tab-bar-closed-tabs))))

  (add-hook 'persp-activated-functions
            (defun +workspaces-load-tab-bar-data-h (_)
              (tab-bar-tabs-set (persp-parameter 'tab-bar-tabs))
              (setq tab-bar-closed-tabs (persp-parameter 'tab-bar-closed-tabs))
              (tab-bar--update-tab-bar-lines t)))
  (tab-bar-mode 1))
#+end_src

*** Split windows to the right and down by default

#+begin_src emacs-lisp :tangle yes
(setq evil-vsplit-window-right t
      evil-split-window-below t)
#+end_src

