.config/doom/config.org
*** Projectile tweaks
Automatically find projects in ~$HOME/repos~

#+begin_src emacs-lisp :tangle yes
(setq projectile-project-search-path '("~/repos"))
#+end_src

Default action on opening a project is dired

#+begin_src emacs-lisp :tangle yes
(setq projectile-switch-project-action #'projectile-dired)
#+end_src

Recognize Rails/RSpec projects

#+begin_src emacs-lisp :tangle yes
(after! projectile
  (projectile-register-project-type
   'rails-rspec '("Gemfile" "app" "lib" "db" "config" "spec")
   :project-file "Gemfile"
   :compile "bundle exec rails server"
   :src-dir "lib/"
   :test "bundle exec rspec"
   :test-dir "spec/"
   :test-suffix "_spec")
    )
#+end_src

*** Vterm
Send C-c to the terminal

#+begin_src emacs-lisp :tangle yes
(map! :after vterm
      :map vterm-mode-map
      :ni "C-c" (vterm-send-key (kbd "C-c")))
#+end_src

*** Indent bars
See [[https://github.com/jdtsmith/indent-bars/blob/main/examples.md][examples]] in ~indent-bars~ repo

#+begin_src emacs-lisp :tangle yes
(use-package! indent-bars
  :config
  (setq
    indent-bars-color '(highlight :face-bg t :blend 0.15)
    indent-bars-pattern "."
    indent-bars-width-frac 0.1
    indent-bars-pad-frac 0.1
    indent-bars-zigzag nil
    indent-bars-color-by-depth '(:regexp "outline-\\([0-9]+\\)" :blend 1) ; blend=1: blend with BG only
    indent-bars-highlight-current-depth '(:blend 0.5) ; pump up the BG blend on current
    indent-bars-display-on-blank-lines t)
  :hook ((prog-mode) . indent-bars-mode))
#+end_src

#+RESULTS:
: t
*** File path in modeline
Show buffer names relative to project

#+begin_src emacs-lisp :tangle yes
(setq! doom-modeline-buffer-file-name-style 'relative-to-project)
#+end_src

** Custom keybindings
Some convenience from Vim:

#+begin_src emacs-lisp :tangle yes
(setq evil-escape-key-sequence "jj"
      evil-escape-delay 0.3)
#+end_src

Use j/k to move up/down in visual lines

#+begin_src emacs-lisp :tangle yes
(evil-global-set-key 'motion "j" 'evil-next-visual-line)
(evil-global-set-key 'motion "k" 'evil-previous-visual-line)
#+end_src

Vim-style movement in undo-tree

#+begin_src emacs-lisp :tangle yes
; FIXME: Does not work apparently
(after! undo-tree
  (define-key undo-tree-visualizer-mode-map (kbd "j")
    'undo-tree-visualize-redo)
  (define-key undo-tree-visualizer-mode-map (kbd "k")
    'undo-tree-visualize-undo)
  (define-key undo-tree-visualizer-mode-map (kbd "h")
    'undo-tree-visualize-switch-branch-left)
  (define-key undo-tree-visualizer-mode-map (kbd "l")
    'undo-tree-visualize-switch-branch-right)
  )
#+end_src

An easier way to call =avy-goto-char-timer=:

#+begin_src emacs-lisp :tangle yes
(setq avy-all-windows t)
(map! "C-c SPC" #'avy-goto-char-2)
#+end_src
* Utilities
Get secrets from authinfo:

#+begin_src emacs-lisp :tangle yes
(setq auth-sources '("~/.authinfo.gpg"))

(defun gt/lookup-password (&rest keys)
  (let ((result (apply #'auth-source-search keys)))
    (if result
        (funcall (plist-get (car result) :secret))
      nil)))
#+end_src

Is this a work machine?
#+begin_src emacs-lisp :tangle yes
(defun gt/work-machine? ()
    (string-prefix-p "banqiao" (system-name)))
#+end_src
* Git
** Magit
Show more recent commits

#+begin_src emacs-lisp :tangle yes
(use-package! magit
  :config
  (setq magit-log-section-commit-count 20))
#+end_src

Correctly handle escape sequences in output of e.g. pre-commit hooks

#+begin_src emacs-lisp :tangle yes
(defun color-buffer (proc &rest args)
  (interactive)
  (with-current-buffer (process-buffer proc)
    (read-only-mode -1)
    (ansi-color-apply-on-region (point-min) (point-max))
    (read-only-mode 1)))

(advice-add 'magit-process-filter :after #'color-buffer)
#+end_src

Project TODOs in Magit

#+begin_src emacs-lisp :tangle yes
(use-package! magit-todos
  :after magit
  :config (magit-todos-mode 1))
#+end_src

* Programming
Easily jump between the beginning and end of blocks

#+begin_src emacs-lisp :tangle yes
(global-evil-matchit-mode 1)
#+end_src

For some reason, typescript indent level needs to be manually set

#+begin_src emacs-lisp :tangle yes
; FIXME: We really should not have to do this manually!
(setq typescript-indent-level 2)
#+end_src

Show the fill column indicator and turn on rainbow delimiters for programming modes

#+begin_src emacs-lisp :tangle yes
(add-hook 'prog-mode-hook #'display-fill-column-indicator-mode)
(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
#+end_src

Use [[https://mise.jdx.dev/][Mise]] to manage ruby/node/etc versions

#+begin_src emacs-lisp :tangle yes
(use-package! mise
 :config
 (add-hook 'doom-after-init-hook #'global-mise-mode))
#+end_src

** LLM integration
#+begin_src emacs-lisp :tangle yes
(after! gptel
  (setq
   gptel-display-buffer-action t
   gptel-default-mode 'org-mode
   gptel-model 'claude-3-7-sonnet-20250219
   gptel-backend (gptel-make-anthropic "Claude"
                   :stream t
                   :key (gt/lookup-password :host "api.anthropic.com")))
  (gptel-make-openai "DeepSeek"
    :host "api.deepseek.com"
    :endpoint "/chat/completions"
    :stream t
    :key (gt/lookup-password :host "api.deepseek.com")
    :models '(deepseek-reasoner deepseek-chat deepseek-coder))
  (gptel-make-ollama "Ollama"
    :host "localhost:11434"
    :stream t
    :models '(deepseek-r1:latest))
  (add-to-list 'gptel-directives
               '(clojure-dev . "you're a senior clojure/clojurescript dev with strong fp discipline. respond in PURE code blocks except: (1) when identifying errors (add terse explanations), (2) when clarification is needed (ask briefly), or (3) when suggesting changes (provide git-style diffs). prioritize idiomatic clojure: immutable data, pure functions, thread-last macros where appropriate. flag any non-obvious performance implications or side effects. favor core functions over 3rd-party libs when reasonable."))
  (add-to-list 'gptel-directives
               '(haskell-dev . "You are an expert Haskell programming assistant with deep knowledge of functional programming paradigms, type theory, monads, and Haskell's standard libraries.

Your capabilities:
1. Generate syntactically correct and idiomatic Haskell code based on natural language descriptions
2. Debug existing Haskell code by identifying compiler errors, runtime issues, and logical flaws
3. Refactor code to improve performance, readability, and maintainability
4. Explain complex Haskell concepts with clear examples
5. Recommend appropriate libraries and language extensions for specific tasks

When analyzing or generating Haskell code, you should:
- Prioritize pure functional approaches with immutable data
- Leverage the type system to catch errors at compile time
- Use appropriate abstractions (functors, applicatives, monads) without overcomplicating
- Consider performance implications, especially regarding laziness and space leaks
- Follow Haskell community style guidelines

When I share code that has errors or issues, you should:
1. Identify specific problems, referencing GHC error messages if provided
2. Explain the underlying issues in clear, educational terms
3. Provide corrected versions with explanations of your changes
4. Suggest alternative approaches when appropriate

For complex tasks, break down your solution process into:
1. Understanding the problem requirements
2. Designing appropriate data structures and type signatures
3. Implementing core functionality with clear, documented code
4. Testing considerations, including edge cases and property-based tests

Always provide explanations alongside your code to help me learn and understand the functional programming concepts involved.")))
  ;; :bind
  ;; ("C-c g g" . gptel)
  ;; ("C-c g a" . gptel-add)
  ;; ("C-c g f" . gptel-add-file)
  ;; ("C-c g m" . gptel-menu)
  ;; ("C-c g s" . gptel-send)
  ;; ("C-c g o t" . gptel-org-set-topic)
  ;; ("C-c g o p" . gptel-org-set-properties))
#+end_src

