.config/doom/config.el

(setq projectile-project-search-path '("~/repos"))

(setq projectile-switch-project-action #'projectile-dired)

(after! projectile
  (projectile-register-project-type
   'rails-rspec '("Gemfile" "app" "lib" "db" "config" "spec")
   :project-file "Gemfile"
   :compile "bundle exec rails server"
   :src-dir "lib/"
   :test "bundle exec rspec"
   :test-dir "spec/"
   :test-suffix "_spec")
    )

(map! :after vterm
      :map vterm-mode-map
      :ni "C-c" (vterm-send-key (kbd "C-c")))

(use-package! indent-bars
  :config
  (setq
    indent-bars-color '(highlight :face-bg t :blend 0.15)
    indent-bars-pattern "."
    indent-bars-width-frac 0.1
    indent-bars-pad-frac 0.1
    indent-bars-zigzag nil
    indent-bars-color-by-depth '(:regexp "outline-\\([0-9]+\\)" :blend 1) ; blend=1: blend with BG only
    indent-bars-highlight-current-depth '(:blend 0.5) ; pump up the BG blend on current
    indent-bars-display-on-blank-lines t)
  :hook ((prog-mode) . indent-bars-mode))

(setq! doom-modeline-buffer-file-name-style 'relative-to-project)

(setq evil-escape-key-sequence "jj"
      evil-escape-delay 0.3)

(evil-global-set-key 'motion "j" 'evil-next-visual-line)
(evil-global-set-key 'motion "k" 'evil-previous-visual-line)

; FIXME: Does not work apparently
(after! undo-tree
  (define-key undo-tree-visualizer-mode-map (kbd "j")
    'undo-tree-visualize-redo)
  (define-key undo-tree-visualizer-mode-map (kbd "k")
    'undo-tree-visualize-undo)
  (define-key undo-tree-visualizer-mode-map (kbd "h")
    'undo-tree-visualize-switch-branch-left)
  (define-key undo-tree-visualizer-mode-map (kbd "l")
    'undo-tree-visualize-switch-branch-right)
  )

(setq avy-all-windows t)
(map! "C-c SPC" #'avy-goto-char-2)

(setq auth-sources '("~/.authinfo.gpg"))

(defun gt/lookup-password (&rest keys)
  (let ((result (apply #'auth-source-search keys)))
    (if result
        (funcall (plist-get (car result) :secret))
      nil)))

(use-package! magit
  :config
  (setq magit-log-section-commit-count 20))

(defun color-buffer (proc &rest args)
  (interactive)
  (with-current-buffer (process-buffer proc)
    (read-only-mode -1)
    (ansi-color-apply-on-region (point-min) (point-max))
    (read-only-mode 1)))

(advice-add 'magit-process-filter :after #'color-buffer)

(use-package! magit-todos
  :after magit
  :config (magit-todos-mode 1))

(global-evil-matchit-mode 1)

; FIXME: We really should not have to do this manually!
(setq typescript-indent-level 2)

(use-package! mise
 :config
 (add-hook 'doom-after-init-hook #'global-mise-mode))

(after! gptel
  (setq
   gptel-display-buffer-action t
   gptel-default-mode 'org-mode
   gptel-model 'claude-3-7-sonnet-20250219
   gptel-backend (gptel-make-anthropic "Claude"
                   :stream t
                   :key (gt/lookup-password :host "api.anthropic.com")))
  (gptel-make-openai "DeepSeek"
    :host "api.deepseek.com"
    :endpoint "/chat/completions"
    :stream t
    :key (gt/lookup-password :host "api.deepseek.com")
    :models '(deepseek-reasoner deepseek-chat deepseek-coder))
  (gptel-make-ollama "Ollama"
    :host "localhost:11434"
    :stream t
    :models '(deepseek-r1:latest))
  (add-to-list 'gptel-directives
               '(clojure-dev . "you're a senior clojure/clojurescript dev with strong fp discipline. respond in PURE code blocks except: (1) when identifying errors (add terse explanations), (2) when clarification is needed (ask briefly), or (3) when suggesting changes (provide git-style diffs). prioritize idiomatic clojure: immutable data, pure functions, thread-last macros where appropriate. flag any non-obvious performance implications or side effects. favor core functions over 3rd-party libs when reasonable."))
  (add-to-list 'gptel-directives
               '(haskell-dev . "You are an expert Haskell programming assistant with deep knowledge of functional programming paradigms, type theory, monads, and Haskell's standard libraries.

Your capabilities:
1. Generate syntactically correct and idiomatic Haskell code based on natural language descriptions
2. Debug existing Haskell code by identifying compiler errors, runtime issues, and logical flaws
3. Refactor code to improve performance, readability, and maintainability
4. Explain complex Haskell concepts with clear examples
5. Recommend appropriate libraries and language extensions for specific tasks

When analyzing or generating Haskell code, you should:
- Prioritize pure functional approaches with immutable data
- Leverage the type system to catch errors at compile time
- Use appropriate abstractions (functors, applicatives, monads) without overcomplicating
- Consider performance implications, especially regarding laziness and space leaks
- Follow Haskell community style guidelines

When I share code that has errors or issues, you should:
1. Identify specific problems, referencing GHC error messages if provided
2. Explain the underlying issues in clear, educational terms
3. Provide corrected versions with explanations of your changes
4. Suggest alternative approaches when appropriate

For complex tasks, break down your solution process into:
1. Understanding the problem requirements
2. Designing appropriate data structures and type signatures
3. Implementing core functionality with clear, documented code
4. Testing considerations, including edge cases and property-based tests

Always provide explanations alongside your code to help me learn and understand the functional programming concepts involved.")))
  ;; :bind
  ;; ("C-c g g" . gptel)
  ;; ("C-c g a" . gptel-add)
  ;; ("C-c g f" . gptel-add-file)
  ;; ("C-c g m" . gptel-menu)
  ;; ("C-c g s" . gptel-send)
  ;; ("C-c g o t" . gptel-org-set-topic)
  ;; ("C-c g o p" . gptel-org-set-properties))

(after! lsp-mode
