.config/doom/config.org
** Ruby
Additional LSP configuration

#+begin_src emacs-lisp :tangle yes
(after! lsp-mode
  (require 'lsp-sorbet)
  (add-to-list 'lsp-disabled-clients 'sorbet-ls)

  (defun gt/project-has-sorbet-p ()
    "Does this project use Sorbet?"
    (or (locate-dominating-file default-directory "sorbet")
        (when-let* ((root (locate-dominating-file default-directory "Gemfile.lock"))
                    (gemfile-lock (expand-file-name "Gemfile.lock" root)))
          (with-temp-buffer
            (insert-file-contents gemfile-lock)
            (search-forward-regexp "^ *sorbet \\|^ *sorbet-static " nil t)))))

  (lsp-register-client
   (make-lsp-client
    :new-connection (lsp-stdio-connection
                     (lambda ()
                       (when (gt/project-has-sorbet-p)
                         (if (file-exists-p "Gemfile")
                             '("bundle" "exec" "srb" "tc" "--lsp")
                           '("srb" "tc" "--lsp")))))
    :activation-fn (lambda (filename _mode)
                     (and (eq major-mode 'ruby-mode) (gt/project-has-sorbet-p)))
    :priority -1
    :add-on? t
    :server-id 'gt/sorbet-ls))

  (setq lsp-rubocop-use-bundler t
        lsp-sorbet-use-bundler t
        lsp-sorbet-as-add-on t)
                                        ; Use HTML lsp server for .html.erb files
  (add-to-list 'lsp-language-id-configuration '("\\.html\\.erb$" . "html")))

(add-hook 'ruby-mode-hook
          (lambda ()
            (setq-local lsp-enabled-clients '(ruby-lsp-ls gt/sorbet-ls))
            (lsp)))
#+end_src

** IDE
*** Navigation
Use ~lsp-ui-peek~ for definitions and references.

#+begin_src emacs-lisp :tangle yes
(defun gt/setup-lsp-ui-peek ()
  (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
  (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references))

(add-hook 'lsp-ui-mode-hook #'gt/setup-lsp-ui-peek)
#+end_src

*** Clojure
Use [[https://github.com/oakmac/standard-clojure-style-js?tab=readme-ov-file][Standard Clojure Style formatter]] for Clojure code

#+begin_src emacs-lisp :tangle yes
(use-package! apheleia
  :ensure apheleia
  :config
  (if (gt/work-machine?)
      ;; On work machine: remove Clojure modes from Apheleia
      (progn
        (setq apheleia-mode-alist 
              (cl-remove-if (lambda (pair)
                              (memq (car pair) '(clojure-mode 
                                                 clojurec-mode 
                                                 clojurescript-mode
                                                 clojure-ts-mode
                                                 clojure-ts-clojurescript-mode
                                                 clojure-ts-clojurec-mode
                                                 clojure-ts-clojuredart-mode)))
                            apheleia-mode-alist)))
    ;; On personal machines: use standard-clj
    (progn
      (setf (alist-get 'standard-clojure apheleia-formatters) '("standard-clj" "fix" "-"))
      (setf (alist-get 'clojure-mode apheleia-mode-alist) 'standard-clojure)
      (setf (alist-get 'clojure-ts-mode apheleia-mode-alist) 'standard-clojure)
      (setf (alist-get 'clojure-ts-clojurescript-mode apheleia-mode-alist) 'standard-clojure)
      (setf (alist-get 'clojure-ts-clojurec-mode apheleia-mode-alist) 'standard-clojure)
      (setf (alist-get 'clojure-ts-clojuredart-mode apheleia-mode-alist) 'standard-clojure)
      (setf (alist-get 'clojurec-mode apheleia-mode-alist) 'standard-clojure)
      (setf (alist-get 'clojurescript-mode apheleia-mode-alist) 'standard-clojure)))
  (apheleia-global-mode +1))
#+end_src

Disable Clojure autoformatting on work machine

#+begin_src emacs-lisp :tangle yes
(when (gt/work-machine?)
  (setq +format-on-save-disabled-modes
        (cl-union '(clojure-mode
                    clojurec-mode
                    clojure-ts-mode
                    clojurescript-mode)
                  +format-on-save-disabled-modes))

  ;; Configure Clojure commenting to match project style guide
  (dolist (mode-hook '(clojure-mode-hook
                       clojure-ts-mode-hook
                       clojurescript-mode-hook
                       clojurec-mode-hook))
    (add-hook mode-hook
              (lambda ()
                ;; Use single semicolon for comments (not double)
                (setq-local comment-start ";")
                ;; Don't add extra semicolons when using M-;
                (setq-local comment-add 0)
                ;; Override comment-indent-function directly for this buffer
                (setq-local comment-indent-function
                            (lambda ()
                              (if (bolp) 0 (current-indentation))))
                ;; Set line width to 90 characters (project style guide)
                (setq-local fill-column 90)
                ;; Also set whitespace-mode to highlight long lines at 90
                (setq-local whitespace-line-column 90)))))
#+end_src


*** Biome support
#+begin_src emacs-lisp :tangle yes
(use-package! lsp-biome
  :after lsp-mode)
#+end_src

*** JavaScript/TypeScript LSP configuration
Only enable ESLint when a config file is present in the project.
#+begin_src emacs-lisp :tangle yes
;; (after! lsp-mode
;;   ;; Function to check if ESLint config exists in project
;;   (defun gt/eslint-config-exists-p ()
;;     "Check if ESLint config exists in the current project."
;;     (or (locate-dominating-file default-directory ".eslintrc")
;;         (locate-dominating-file default-directory ".eslintrc.js")
;;         (locate-dominating-file default-directory ".eslintrc.json")
;;         (locate-dominating-file default-directory ".eslintrc.yml")
;;         (locate-dominating-file default-directory ".eslintrc.yaml")
;;         (locate-dominating-file default-directory "eslint.config.js")
;;         (locate-dominating-file default-directory "eslint.config.mjs")
;;         (locate-dominating-file default-directory "eslint.config.cjs")))

;;   ;; Hook to conditionally enable/disable ESLint
;;   (add-hook 'lsp-after-initialize-hook
;;             (lambda ()
;;               (when (or (derived-mode-p 'js-mode 'js2-mode 'typescript-mode 'typescript-ts-mode 'tsx-ts-mode)
;;                         (and (derived-mode-p 'web-mode)
;;                              (member (file-name-extension buffer-file-name) '("js" "jsx" "ts" "tsx"))))
;;                 (setq-local lsp-eslint-enable (gt/eslint-config-exists-p))))))
#+end_src

** Emacs metaprogramming
Set the scratch buffer to open in ~lisp-interaction-mode~ by default.

#+begin_src emacs-lisp :tangle yes
(setq-default doom-scratch-initial-major-mode 'lisp-interaction-mode)
#+end_src

** Conveniences
Make script files executable when saving
#+begin_src emacs-lisp :tangle yes
(add-hook 'after-save-hook
          'executable-make-buffer-file-executable-if-script-p)
#+end_src

Support for ASCII Doc file format
#+begin_src emacs-lisp :tangle yes
(use-package! adoc-mode)
#+end_src

* Org-mode
Set the working directory for Org files.

#+begin_src emacs-lisp :tangle yes
(setq org-directory "~/org/")
#+end_src

** Spacing
Add a blank line before every new heading and plain list items

#+begin_src emacs-lisp :tangle yes
(setq org-blank-before-new-entry
      '((heading . t) (plain-list-item . auto)))
#+end_src

** TO-DO items
Log time items are closed

#+begin_src emacs-lisp :tangle yes
(setq org-log-done 'time)
#+end_src

** Agenda
Build the agenda from work and project files, and add a global key binding to the default agenda view:

#+begin_src emacs-lisp :tangle yes
(defun gt/open-agenda ()
  (interactive)
  (org-agenda nil "a"))

(use-package! org
  :config
  (setq org-agenda-files
        (list (concat org-directory "work/")
              (concat org-directory "projects/"))
        org-agenda-start-with-log-mode t
        org-agenda-start-with-clockreport-mode t)
  :bind
  ("C-c a" . gt/open-agenda))
#+end_src

** Links DWIM
Code lifted from [[https://xenodium.com/emacs-dwim-do-what-i-mean/][Emacs DWIM: do what ✨I✨ mean]].

#+begin_src emacs-lisp :tangle yes
(defun gt/org-insert-link-dwim ()
  "Like `org-insert-link' but with personal dwim preferences."
  (interactive)
  (let* ((point-in-link (org-in-regexp org-link-any-re 1))
         (clipboard-url (when (string-match-p "^http" (current-kill 0))
                          (current-kill 0)))
         (region-content (when (region-active-p)
                           (buffer-substring-no-properties (region-beginning)
                                                           (region-end)))))
    (cond ((and region-content clipboard-url (not point-in-link))
           (delete-region (region-beginning) (region-end))
           (insert (org-make-link-string clipboard-url region-content)))
          ((and clipboard-url (not point-in-link))
           (insert (org-make-link-string
                    clipboard-url
                    (read-string "title: "
                                 (with-current-buffer (url-retrieve-synchronously clipboard-url)
                                   (dom-text (car
                                              (dom-by-tag (libxml-parse-html-region
                                                           (point-min)
                                                           (point-max))
                                                          'title))))))))
          (t
           (call-interactively 'org-insert-link)))))

(use-package! org
  :bind
  ("C-c l" . gt/org-insert-link-dwim))
#+end_src

