.config/doom/config.el
  (require 'lsp-sorbet)
  (add-to-list 'lsp-disabled-clients 'sorbet-ls)

  (defun gt/project-has-sorbet-p ()
    "Does this project use Sorbet?"
    (or (locate-dominating-file default-directory "sorbet")
        (when-let* ((root (locate-dominating-file default-directory "Gemfile.lock"))
                    (gemfile-lock (expand-file-name "Gemfile.lock" root)))
          (with-temp-buffer
            (insert-file-contents gemfile-lock)
            (search-forward-regexp "^ *sorbet \\|^ *sorbet-static " nil t)))))

  (lsp-register-client
   (make-lsp-client
    :new-connection (lsp-stdio-connection
                     (lambda ()
                       (when (gt/project-has-sorbet-p)
                         (if (file-exists-p "Gemfile")
                             '("bundle" "exec" "srb" "tc" "--lsp")
                           '("srb" "tc" "--lsp")))))
    :activation-fn (lambda (filename _mode)
                     (and (eq major-mode 'ruby-mode) (gt/project-has-sorbet-p)))
    :priority -1
    :add-on? t
    :server-id 'gt/sorbet-ls))

  (setq lsp-rubocop-use-bundler t
        lsp-sorbet-use-bundler t
        lsp-sorbet-as-add-on t)
                                        ; Use HTML lsp server for .html.erb files
  (add-to-list 'lsp-language-id-configuration '("\\.html\\.erb$" . "html")))

(add-hook 'ruby-mode-hook
          (lambda ()
            (setq-local lsp-enabled-clients '(ruby-lsp-ls gt/sorbet-ls))
            (lsp)))

(defun gt/setup-lsp-ui-peek ()
  (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
  (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references))

(add-hook 'lsp-ui-mode-hook #'gt/setup-lsp-ui-peek)

(use-package! apheleia
  :ensure apheleia
  :config
  (setf (alist-get 'standard-clojure apheleia-formatters) '("standard-clj" "fix" "-"))
  (setf (alist-get 'clojure-mode apheleia-mode-alist) 'standard-clojure)
  (setf (alist-get 'clojure-ts-mode apheleia-mode-alist) 'standard-clojure)
  (setf (alist-get 'clojurec-mode apheleia-mode-alist) 'standard-clojure)
  (setf (alist-get 'clojurescript-mode apheleia-mode-alist) 'standard-clojure)
  (apheleia-global-mode +1))

(when (string= (system-name) "banqiao.local")
  (append '(clojure-mode
            clojurec-mode
            clojure-ts-mode
            clojurescript-mode)
          +format-on-save-disabled-modes))

(use-package! lsp-biome
  :after lsp-mode)

;; (after! lsp-mode
;;   ;; Function to check if ESLint config exists in project
;;   (defun gt/eslint-config-exists-p ()
;;     "Check if ESLint config exists in the current project."
;;     (or (locate-dominating-file default-directory ".eslintrc")
;;         (locate-dominating-file default-directory ".eslintrc.js")
;;         (locate-dominating-file default-directory ".eslintrc.json")
;;         (locate-dominating-file default-directory ".eslintrc.yml")
;;         (locate-dominating-file default-directory ".eslintrc.yaml")
;;         (locate-dominating-file default-directory "eslint.config.js")
;;         (locate-dominating-file default-directory "eslint.config.mjs")
;;         (locate-dominating-file default-directory "eslint.config.cjs")))

;;   ;; Hook to conditionally enable/disable ESLint
;;   (add-hook 'lsp-after-initialize-hook
;;             (lambda ()
;;               (when (or (derived-mode-p 'js-mode 'js2-mode 'typescript-mode 'typescript-ts-mode 'tsx-ts-mode)
;;                         (and (derived-mode-p 'web-mode)
;;                              (member (file-name-extension buffer-file-name) '("js" "jsx" "ts" "tsx"))))
;;                 (setq-local lsp-eslint-enable (gt/eslint-config-exists-p))))))

(setq-default doom-scratch-initial-major-mode 'lisp-interaction-mode)

(add-hook 'after-save-hook
          'executable-make-buffer-file-executable-if-script-p)

(use-package! adoc-mode)

(setq org-directory "~/org/")

(setq org-blank-before-new-entry
      '((heading . t) (plain-list-item . auto)))

(setq org-log-done 'time)

(defun gt/open-agenda ()
  (interactive)
  (org-agenda nil "a"))

(use-package! org
  :config
  (setq org-agenda-files
        (list (concat org-directory "work/")
              (concat org-directory "projects/"))
        org-agenda-start-with-log-mode t
        org-agenda-start-with-clockreport-mode t)
  :bind
  ("C-c a" . gt/open-agenda))

(defun gt/org-insert-link-dwim ()
  "Like `org-insert-link' but with personal dwim preferences."
  (interactive)
  (let* ((point-in-link (org-in-regexp org-link-any-re 1))
         (clipboard-url (when (string-match-p "^http" (current-kill 0))
                          (current-kill 0)))
         (region-content (when (region-active-p)
                           (buffer-substring-no-properties (region-beginning)
                                                           (region-end)))))
    (cond ((and region-content clipboard-url (not point-in-link))
           (delete-region (region-beginning) (region-end))
           (insert (org-make-link-string clipboard-url region-content)))
          ((and clipboard-url (not point-in-link))
           (insert (org-make-link-string
                    clipboard-url
                    (read-string "title: "
                                 (with-current-buffer (url-retrieve-synchronously clipboard-url)
                                   (dom-text (car
                                              (dom-by-tag (libxml-parse-html-region
                                                           (point-min)
                                                           (point-max))
                                                          'title))))))))
          (t
           (call-interactively 'org-insert-link)))))

(use-package! org
  :bind
  ("C-c l" . gt/org-insert-link-dwim))
