.config/doom/config.el

(setq org-roam-completion-everywhere t)

(setq org-roam-mode-section-functions
      (list #'org-roam-backlinks-section
            #'org-roam-reflinks-section
            ;; #'org-roam-unlinked-references-section
            ))

(use-package! org-roam-ui
  :init
  (when (featurep 'xwidget-internal)
    (setq org-roam-ui-browser-function #'xwidget-webkit-browse-url)))

(use-package! org-roam
  :bind
  ("C-c j j" . org-roam-dailies-goto-today)
  ("C-c j i" . org-roam-dailies-capture-today))

(defun gt/daily-location ()
  (let ((location
         (with-temp-buffer
           (insert-file-contents-literally "~/.current_location.txt")
           (split-string
            (string-trim-right
             (buffer-substring-no-properties (point-min) (point-max)))
            ","))))
    (format "%s (%s)" (nth 0 location) (nth 1 location))))

(defun gt/daily-weather ()
  (string-trim-right
   (shell-command-to-string "~/.bin/location_weather.sh")))

(defun gt/daily-pregnancy-week-day (time-stamp)
  (let* ((days-since (- (org-time-stamp-to-now time-stamp)))
         (weeks (/ days-since 7))
         (days (- days-since (* weeks 7))))
    (format "Week %s, Day %s" weeks days)))

(require 'cl-lib)
(require 'calendar)  ;; for calendar-last-day-of-month

(defun gt/join-with-oxford (parts)
  (pcase (length parts)
    (0 "")
    (1 (car parts))
    (2 (format "%s and %s" (nth 0 parts) (nth 1 parts)))
    (_ (format "%s, and %s"
               (string-join (butlast parts) ", ")
               (car (last parts))))))

(defun gt/child-age (birth-date)
  "age since BIRTH-DATE:
- <1yr → if <7d → \"D days\", else \"W weeks and D days\"
- ≥1yr → \"Y years, M months, and D days\""
  (let* ((b      (parse-time-string birth-date))
         (by     (nth 5 b)) (bm (nth 4 b)) (bd (nth 3 b))
         (c      (decode-time (current-time)))
         (cy     (nth 5 c)) (cm (nth 4 c)) (cd (nth 3 c))
         (raw    (round (org-time-stamp-to-now birth-date)))
         (days   (abs raw)))
    (cl-destructuring-bind (y m d)
        (let* ((y (- cy by))
               (m (- cm bm))
               (d (- cd bd)))
          (when (< d 0)
            (let* ((pm   (if (= cm 1) 12 (1- cm)))
                   (py   (if (= cm 1) (1- cy) cy))
                   (mdays (car (calendar-last-day-of-month (list py pm)))))
              (setq d (+ d mdays)
                    m (1- m))))
          (when (< m 0)
            (setq m (+ m 12)
                  y (1- y)))
          (list y m d))
      (if (< y 1)
          (if (< days 7)
              (format "%d day%s" days (if (= days 1) "" "s"))
            (let* ((w     (floor days 7))
                   (d2    (mod days 7))
                   (parts (cl-remove-if-not
                           #'identity
                           (list
                            (and (> w 0)
                                 (format "%d week%s" w
                                         (if (= w 1) "" "s")))
                            (and (> d2 0)
                                 (format "%d day%s" d2
                                         (if (= d2 1) "" "s")))))))
              (gt/join-with-oxford parts)))
        (let ((parts (cl-remove-if-not
                      #'identity
                      (list
                       (and (> y 0) (format "%d year%s"   y (if (= y 1) "" "s")))
                       (and (> m 0) (format "%d month%s"  m (if (= m 1) "" "s")))
                       (and (> d 0) (format "%d day%s"    d (if (= d 1) "" "s")))))))
          (gt/join-with-oxford parts))))))

(defun gt/org-roam-on-this-day ()
  "Return a list of links to org-roam daily notes from this day in previous
   years, or NIL if none are found."
  (require 'org-roam)
  (let* ((query "SELECT id, title FROM nodes WHERE file LIKE '%%daily%%' AND file LIKE '%%' || strftime('%%m-%%d', 'now') || '%%' ORDER BY title DESC")
         (rows (org-roam-db-query query))
         (results '()))
    (if (null rows)
        nil
      (progn
        (dolist (row rows)
          (let* ((id (nth 0 row))
                 (title (nth 1 row))
                 (year (substring title 0 4)))
            (push (format "[[id:%s][%s]]" id year) results)))
        (concat "On this day: " (mapconcat 'identity results ", "))))))

(setq org-roam-dailies-capture-templates
      '(("d" "default" entry
         "* %<%H:%M> %?"
         :if-new (file+head
                  "%<%Y-%m-%d>.org"
                  "%[~/org/roam/templates/daily-template.org]"))))

(defun gt/dailies-location-stats (directory)
  "Parse all org files in DIRECTORY and count occurrences of #+location: headers.
Returns an alist of (location . count) sorted by count in descending order."
  (interactive "DDirectory: ")
  (let ((org-files (directory-files-recursively directory "\\.org$"))
        (locations '()))

    ;; Process each org file
    (dolist (file org-files)
      (with-temp-buffer
        (insert-file-contents file)
        (goto-char (point-min))
        (while (re-search-forward "^#\\+location:\\s-*\\(.*\\)$" nil t)
          (let* ((location (string-trim (match-string 1)))
                 (existing (assoc location locations)))
            (if existing
                ;; Increment count if location already exists
                (setcdr existing (1+ (cdr existing)))
              ;; Otherwise add new location with count 1
              (push (cons location 1) locations))))))

    ;; Sort by count (descending)
    (setq locations (sort locations (lambda (a b) (> (cdr a) (cdr b)))))

    ;; Display results in a buffer
    (with-current-buffer (get-buffer-create "*Org Locations*")
      (erase-buffer)
      (insert "| Location | Count |\n")
      (insert "|----------|-------|\n")
      (dolist (loc locations)
        (insert (format "| %s | %d |\n" (car loc) (cdr loc))))
      (org-table-align)
      (goto-char (point-min))
      (switch-to-buffer (current-buffer)))

    ;; Return locations alist
    locations))

(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))

(use-package! org-roam
  :ensure t
  :bind
  ("C-c n n" . org-roam-node-find)
  ("C-c n i" . org-roam-node-insert)
  ("C-c n u" . org-roam-ui-open)
  ("C-c n l" . (lambda ()
                 (interactive)
                 (gt/dailies-location-stats
                  (concat org-roam-directory org-roam-dailies-directory))))
  ("C-c j j" . org-roam-dailies-goto-today)
  ("C-c j i" . org-roam-dailies-capture-today))

(use-package! org
  :config
