.config/doom/config.org
** Writing
Disable line numbers in org files and hide the emphasis markers. ~code~

#+begin_src emacs-lisp :tangle yes
(use-package! org
  :config
  (setq org-hide-emphasis-markers t
        org-preview-latex-default-process 'dvisvgm)
  (plist-put org-format-latex-options :background "Transparent")
  (add-to-list 'org-todo-keyword-faces '("REVW" . +org-todo-onhold))
  (add-hook 'org-mode-hook (lambda () (display-line-numbers-mode -1)
)))
#+end_src

Use ~mixed-pitch-mode~ for org-mode files
#+begin_src emacs-lisp :tangle yes
;; (use-package! mixed-pitch
;;   :hook
;;   (org-mode . mixed-pitch-mode)
;;   :config
;;   (setq! mixed-pitch-set-height gt/base-font-size)
;;   (setq org-hide-emphasis-markers t)
;;   (add-to-list 'mixed-pitch-fixed-pitch-faces 'org-drawer))
#+end_src

Word count:
#+begin_src emacs-lisp :tangle yes
(use-package! wc-mode
  :config
  (global-set-key "\C-cw" 'wc-mode))

;; NOTE: These are not the same
(setq doom-modeline-enable-word-count t)
#+end_src

Enable typo-mode for all =text-mode= buffers

#+begin_src emacs-lisp :tangle yes
(use-package! typo
  :config
  (typo-global-mode 1)
  (add-hook 'text-mode-hook 'typo-mode))
#+end_src

Highlight visual line instead of actual line (for wrapped text)

#+begin_src emacs-lisp :tangle yes
(defun gt/visual-line-range ()
  (save-excursion
    (cons
     (progn (beginning-of-visual-line) (point))
     (progn (end-of-visual-line) (point)))))
#+end_src

Russian QWERTY layout for writing
#+begin_src emacs-lisp :tangle yes
;; (use-package! quail-russian-qwerty)
#+end_src

Languagetool support
#+begin_src emacs-lisp :tangle yes
;; TODO: Fix this
;; (use-package lsp-ltex
;;   :ensure t
;;   :hook (text-mode . (lambda ()
;;                        (require 'lsp-ltex)
;;                        (lsp)))  ; or lsp-deferred
;;   :init
;;   (setq lsp-ltex-version "16.0.0"))  ; make sure you have set this, see below
#+end_src

** Anki
Quickly insert an Anki card

#+begin_src emacs-lisp :tangle yes
(defun gt/insert-anki-card ()
  "Insert a new Anki note at the bottom of the current subtree."
  (interactive)
  (let* ((question (read-string "Question: "))
         (current-level (org-current-level))
         (subheading-level (+ 2 current-level))
         (deck "")
         (tags "")
         (last-card-properties (save-excursion
                                 (save-restriction
                                   (org-narrow-to-subtree)
                                   (goto-char (point-max))
                                   (if (re-search-backward ":ANKI_DECK:" nil t)
                                       (let ((deck (org-entry-get (point) "ANKI_DECK"))
                                             (tags (org-entry-get (point) "ANKI_TAGS")))
                                         (list deck tags))
                                     (list nil nil)))))
         (deck (or (nth 0 last-card-properties) ""))
         (tags (or (nth 1 last-card-properties) "")))
    (org-insert-subheading nil)
    (insert (format "%s\n:PROPERTIES:\n:ANKI_DECK: %s\n:ANKI_NOTE_TYPE: Basic\n:ANKI_TAGS: %s\n:END:\n"
                    question deck tags))
    (insert (format "%s Front\n%s\n"
                    (make-string subheading-level ?*) question))
    (insert (format "%s Back\n"
                    (make-string subheading-level ?*))))
  (outline-up-heading 1))
#+end_src

Tag autocomplete for Anki cards

#+begin_src emacs-lisp :tangle yes
(defun gt/get-anki-tags ()
  "Collect all unique :ANKI_TAGS: in the current org buffer."
  (let ((tags '()))
    (save-restriction
      (widen)
      (org-element-map (org-element-parse-buffer) 'node-property
        (lambda (property)
          (when (string= (org-element-property :key property) "ANKI_TAGS")
            (setq tags (append tags (split-string (org-element-property :value property) " "))))))
      (delete-dups tags))))

(defun gt/anki-tags-autocomplete ()
  "Autocomplete for :ANKI_TAGS: property."
  (interactive)
  (let* ((tags (gt/get-anki-tags))
         (selected-tags (completing-read-multiple "Select tags: " tags nil t)))
    (org-set-property "ANKI_TAGS" (mapconcat 'identity selected-tags " "))))
#+end_src

Key bindings

#+begin_src emacs-lisp :tangle yes
(use-package! anki-editor
  :config
  (define-key org-mode-map (kbd "C-c n a a") #'gt/insert-anki-card)
  (define-key org-mode-map (kbd "C-c n a t") #'gt/anki-tags-autocomplete)
  (define-key org-mode-map (kbd "C-c n a p") #'anki-editor-push-notes)
  (which-key-add-key-based-replacements
    "C-c n a a" "Insert Anki card"
    "C-c n a t" "Select tags for card"
    "C-c n a p" "Push cards to Anki"))
#+end_src

** Time Tracking
*** Pomodoro
Keep the time spent on a killed pomodoro

#+begin_src emacs-lisp :tangle yes
(setq org-pomodoro-keep-killed-pomodoro-time t)
#+end_src

Don’t play sounds on Pomodoro events (notifications are enough)

#+begin_src emacs-lisp :tangle yes
(setq org-pomodoro-play-sounds nil)
#+end_src

*** Time format
For work, we want hours only (not days, weeks, months)

#+begin_src emacs-lisp :tangle yes
(when (gt/work-machine?)
  (setq org-duration-format (quote h:mm)))
#+end_src

*** Resolving idle time
For work, we want to automatically stop a timer after 15 minutes idle.

#+begin_src emacs-lisp :tangle yes
(when (gt/work-machine?)
  (setq org-clock-idle-time 15))
#+end_src

** Tweaks
*** Pomodoro notifications
Set path to ~terminal-notifier~ executable

#+begin_src emacs-lisp :tangle yes
(setq alert-notifier-command (executable-find "terminal-notifier"))
#+end_src

*** Corfu
Candidate selection tweaks
#+begin_src emacs-lisp :tangle yes
(use-package! corfu
  :config
  (setq corfu-preselect 'first
        corfu-preview-current 'insert))
#+end_src

*** Inline images
Set default inline image width to 500px, and show them on startup for files that have them.

#+begin_src emacs-lisp :tangle yes
(setq org-image-actual-width 500
      org-startup-with-inline-images t)
#+end_src

*** Capture frame parameters
Make sure the capture frame is centered on the screen
#+begin_src emacs-lisp :tangle yes
(nconc +org-capture-frame-parameters '((top . 0.5) (left . 0.5)))
#+end_src

